In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

1. pd.Series
2. pd.DataFrame
3. pd.size
4. pd.merge
5. pd.shape

In [7]:
#Dataframe function
df = pd.DataFrame({'Name':['Anjani', 'Vijay', 'Anita'],
       'Age':['25','30','27'],
       'Gender':['Female','Male','Female']
       })

In [8]:
df

     Name Age  Gender
0  Anjani  25  Female
1   Vijay  30    Male
2   Anita  27  Female

In [9]:
#Series Function
s=pd.Series([90,100,101,103,105,106])

In [10]:
s

0     90
1    100
2    101
3    103
4    105
5    106
dtype: int64

In [12]:
#size function
df.size

9

In [25]:
#merge function
f1 = pd.DataFrame({'Fruit': ['Apple', 'Grape', 'Orange'],
     'Market Price':[21,45,98]})

In [26]:
f2 = pd.DataFrame({'Fruit':['Apple', 'Grape', 'Orange'],
   'Wholesale price':[18,33,70]})

In [28]:
pd.merge(f1,f2, how='inner',on='Fruit')

    Fruit  Market Price  Wholesale price
0   Apple            21               18
1   Grape            45               33
2  Orange            98               70

In [30]:
#shape function
df

     Name Age  Gender
0  Anjani  25  Female
1   Vijay  30    Male
2   Anita  27  Female

In [31]:
df.shape

(3, 3)

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
f3= pd.DataFrame({'A':[1,2,3,4],'B':[2,3,4,5],'C':[3,4,5,6]})

In [7]:
f3

   A  B  C
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6

In [16]:
def reindex(df):
    new_index = pd.Series(range(1,len(df)*2,2),name='new_index')
    df= df.set_index(new_index)
    return df
df = pd.DataFrame({'A':['10','20','30'],
                  'B':['40','50','60'],
                  'C':['70','80','90']})
df = reindex(df)
print(df)

            A   B   C
new_index
1          10  40  70
3          20  50  80
5          30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [34]:
def sum_of_3(f4):
    if 'Values' in f4.columns:
        result = f4['Values'].head(3).sum()
        return result
    
f4 = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
result = sum_of_3(f4)
print(result)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [60]:
f5 = pd.DataFrame({"Text":['Data', 'Science','masters']})
count = f5['Text'].str.len()
f5['count']=count
f5

      Text  count
0     Data      4
1  Science      7
2  masters      7

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() gives the total number of elements in the dataframe while DataFrame.shape() represents the number of rows and columns.

Q6. Which function of pandas do we use to read an excel file?

We use pd.read_excel() function.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [57]:
f6 = pd.DataFrame({'Email':['jhalak@gmail.com','ajay@gmail.com','datascience@gmail.com']})

In [63]:
Username = f6['Email'].str.split('@').str[0]
f6['Username']= Username

In [64]:
f6

                   Email     Username
0       jhalak@gmail.com       jhalak
1         ajay@gmail.com         ajay
2  datascience@gmail.com  datascience

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [5]:
df5 = pd.DataFrame({'A':[3,8,6,2,9],
                   'B':[5,2,9,3,1],
                   'C':[1,7,4,5,2]})
df5.query('A>5 and B<10')

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [9]:
import numpy as np

In [10]:
f7 =pd.DataFrame({'Values':np.random.randint(0,100,10)})

In [11]:
f7

   Values
0      44
1      45
2      73
3      61
4      44
5      42
6      10
7       6
8      24
9       0

In [13]:
f7.describe().head(3)

          Values
count  10.000000
mean   34.900000
std    24.135958

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [21]:
f8 = pd.DataFrame({'Sales': [40,50,60,70,80,90,100,110,120,130],
                  'Date':pd.date_range(start='2023-01-01', freq='D', periods=10)})
f8['Moving Average']= f8['Sales'].rolling(window=7,min_periods=1).mean()

In [22]:
f8

   Sales       Date  Moving Average
0     40 2023-01-01            40.0
1     50 2023-01-02            45.0
2     60 2023-01-03            50.0
3     70 2023-01-04            55.0
4     80 2023-01-05            60.0
5     90 2023-01-06            65.0
6    100 2023-01-07            70.0
7    110 2023-01-08            80.0
8    120 2023-01-09            90.0
9    130 2023-01-10           100.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [27]:
f9=pd.DataFrame({'Date':pd.date_range(start='2023-01-01', periods=10,freq='D')})
f9['Weekday']=f9['Date'].dt.day_name()

In [28]:
f9

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday
7 2023-01-08     Sunday
8 2023-01-09     Monday
9 2023-01-10    Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [41]:
f10=pd.DataFrame({'Date':pd.date_range(start='2023-01-01', end='2023-01-31')})

def selected_rows(f10, start_date, end_date):
    rows = (f10['Date']> start_date) & (f10['Date'] < end_date)
    dfrow = f10[rows]
    return dfrow
start_date = '2023-01-01'
end_date = '2023-01-15'

selected_rows(f10, start_date, end_date)

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

the first and foremost li